-- 날짜 함수
-- TODO

-- 기본적인 연산
-- TODO

-- 일자 차이 계산
-- TODO

-- MONTHS_BETWEEN : 두 날짜 사이 개월수 
-- TODO


-- 날짜를 계산할때 어떠한 방법을 쓰느냐에 따라 결과가 상당히 다를수 있으므로 주의 요망

-- #4501
-- professor 테이블에서 오늘(SYSDATE)을 기준으로 
-- 근속연, 근속개월, 근속일를 계산해서 출력
-- 출력양식은 YYYY-MM-DD 로
-- 근속월, 근속일은 반올림 하여 소수점 1자리까지 표현




-- ADD_MONTH 함수 - 달을 추가.
-- TODO



-- LAST_DAY() 해당월의 마지막날
-- NEXT_DAY() 돌아오는 가장 최근 요일의 날짜
-- TODO


-- 날짜의 ROUND() 함수  ,  하루의 반은 정오 12:00:00 이다. 이를 넘어서면 다음 날짜
-- 날짜의 TRUNC() 함수,  무조건 당일 출력.
-- 원서 접수나 상품 주문 등에서 오전까지 접수된 건은 당일 접수 처리. 오후접수는 익일 처리 등에서 사용.
-- TODO