-- 묵시적 자동 형변환 예
-- TODO


-- 묵시적 형변환은 편한것 같지만, 
-- 튜닝에서 뜻하지 않은 성능저하를 가져올수 있다.

-- TODO : 형변환 에러

--###########################################3

-- TO_CHAR 함수  (날짜 -> 문자)

-- TODO : TO_CHAR 사용해보기


-- #4301
-- 다음과 같은 형식으로 시간을 출력해보세요
-- ex) 2017-10-25:23:25:46


-- 한글 표현할때는..


-- #4302
-- 실습
-- Student 테이블의 생일(birthday) 이 3월인 학생의 이름(name) 과 생일(birthday) 를 
-- 다음과 같은 형식으로 출력하세요 (TO_CHAR 사용)


-- TO_CHAR : 대소문자 지정예
-- TODO

--################################################3

TO_CHAR() 함수  - 숫자를 문자로 변환

-- TODO



-- #4303
-- professor 테이블에서 101번 학과 교수들의 이름(name), 연봉(pay) 를 출력하세요,
-- 단, 연봉은 (pay * 12) + bonus로 계산하고 천단위 구분기호로 표시하세요.
-- nvl() / to_char() 사용



--##############################################################3
TO_NUMBER() 함수 - 숫자로 변환

-- TODO

--##############################################################3
TO_DATE() 함수 - 날자로 변환

-- TODO

--#4304
--Professor 테이블에서 1990년 이전에 입사한 교수명과 입사일,
--현재 연봉과 10% 인상 후 연봉을 출력하세요.
--연봉은 보너스(bonus)를 제외한 pay * 12 로 계산하고
--연봉과 인상후 연봉은 천단위 구분 기호를 추가하여 출력하세요





