-----------------------------------------------------------------------
-- 연습
-- student 테이블에서 키(height)가 180 보다 크거나 같은 사람 이름, 키 출력

-- student 테이블에서 몸무게(weight)가 60~80 인 사람의 이름과 체중 출력

-- student 테이블에서는 101번 학과(deptno1) 학생과 201번 학과 학생들을 모두 출력하세요 (in 연산자 활용)

-- Like 연산자 사용:  student 테이블에서 성이 '김' 씨인 사람 조회


-- student 테이블에서 4학년 학생중에 키 가 170cm 이상인 사람의 이름과 학년과 키를 조회하세요

-- student 테이블에서 1학년이거나 또는 몸무게가 80kg 이상인 학생들의 이름과 키와 학년과 몸무게를 출력하세요

-- student 테이블을 사용해서 2학년 중에서 키가 180cm 보다 크면서 몸무게가 70kg 보다 큰 학생들의 이름과 학년과 키와 몸무게를 출력하세요

-- student 테이블: 2학년 학생중에 키가 180cm보다 크거나 또는 몸무게가 70kg 보다 큰 학생들의 이름과 학년과 키와 몸무게를 출력하세요

-- emp 테이블에서 고용일(hiredate)이 1982년 이전인 사람들의 이름(ename) 과 고용일을 출력하세요


-- student 테이블: 1학년 학생의 이름과 생일과 키와 몸무게를 출력하세요, 단 생일이 빠른 사람 순서대로 정렬하세요.

-- student 테이블: 1학년 학생의 이름과 키를 출력하세요, 별명은 ‘이름’, ‘키’ 로 출력.  단 이름은 오름차순으로 정렬하세요


